Reports/ЛистНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ЛистНазначений</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/ПланыЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланыЛечения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>удалитьДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриемовВДень</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дозировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗубВКарте</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомЗубыКарты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментВЗубе</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомСегментыЗубов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструкция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.стомКонструкцииЗубовКлиентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Comment>Документ, созданный первым в рамках одного обращения пациента</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПервичныйПрием</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Comment>Собственный идентификатор элемента плана лечения</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНазначений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииВыработки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеДействийСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеДействийСтационара</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеРежима</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДействиеСтационара</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СправочникМеждународныхНепатентованныхНаименований</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремяВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоВечер</Name>
					<Comment>Для параметров Температурного листа определяет, утренний это или вечерний замер показателя</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВыполнениеПланаЛечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыполнениеПланаЛечения</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПервичныйПрием</Name>
					<Comment>Документ, созданный первым в рамках одного обращения пациента</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭлемента</Name>
					<Comment>Собственный идентификатор элемента плана лечения</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНазначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыНазначений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обследование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Процедура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ИзменениеРежима.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИзменениеРежима</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеРегистрацииПоказателей</Name>
					<Comment>Вид операции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияСтационара</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДействиеСтационара</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДействияМедсестрыСтационара</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СколькоРазВДень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторДействия</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ЛистНазначений/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	// Заполнение параметров по реквизитам отчета.
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Клиент", Клиент);
	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("МедицинскаяКарта", МедицинскаяКарта);
	
	УниверсальныеМеханизмыСервер.ОтчетПриКомпоновкеРезультата(ЭтотОбъект, ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция СформироватьЛистНазначений() Экспорт
	
	ТабДок = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ЛистНазначений");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВидНазначения = Макет.ПолучитьОбласть("СтрокаВидНазначения");
	ОбластьДанные = Макет.ПолучитьОбласть("СтрокаНазначение");
	
	ОписаниеПребывания = Стационар.ПолучитьОписаниеПребыванияПациентаВСтационареПоМедкарте(МедицинскаяКарта);
	
	ОбластьШапка.Параметры.Пациент			= Клиент;
	ОбластьШапка.Параметры.МедицинскаяКарта	= МедицинскаяКарта;
	ОбластьШапка.Параметры.Палата			= ОписаниеПребывания.ПалатаПоступления;
	ОбластьШапка.Параметры.КойкоМесто		= ОписаниеПребывания.КойкоМестоПоступления;
	
	ТабДок.Вывести(ОбластьШапка);
	
	РезультатЗапроса = ПолучитьДанныеНазначений();
	ВыборкаВидыНазначений = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Сч = 0;
	Пока ВыборкаВидыНазначений.Следующий() Цикл
		Cч = Сч+1;
		
		ВыборкаДанныеНазначений = ВыборкаВидыНазначений.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДанныеНазначений.Следующий() Цикл
			ОбластьДанные.Параметры.Назначение		= ВыборкаДанныеНазначений.Назначение;
			ОбластьДанные.Параметры.ДатаНазначения	= ВыборкаДанныеНазначений.ДатаНазначения;
			ОбластьДанные.Параметры.ДатаОтмены		= ВыборкаДанныеНазначений.ДатаОтмены;
			ОбластьДанные.Параметры.РазВДень		= ВыборкаДанныеНазначений.РазВДень;
			ТабДок.Вывести(ОбластьДанные);
		КонецЦикла;
	КонецЦикла;
	
	ТабДок.КлючПараметровПечати = "ЛистНазначений";
	ТабДок.ОтображатьСетку = Ложь;
	Возврат ТабДок;
	
КонецФункции

Функция СформироватьЛистВыполненияНазначений() Экспорт
	
	// Изменения Макеев 10-12-2025 (
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.КлючПараметровПечати = "ЛистВыполненияНазначений";
	ТабДок.РазмерСтраницы = "A4 Rotated";
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	ТабДок.ОтображатьСетку = Ложь;
	
	Макет = Отчеты.ЛистНазначений.ПолучитьМакет("ЛистВыполненияНазначений");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	
	ОбластьШапка.Параметры.ФИО = ОбщегоНазначения.ФамилияИнициалыФизЛица(Клиент);
	ОбластьШапка.Параметры.ДатаРождения = Формат(Клиент.ДатаРождения, "ДФ=dd.MM.yyyy");
	ОбластьШапка.Параметры.НомерМедКарты = МедицинскаяКарта.НомерКарты;
	ОбластьШапка.Параметры.НомерПалаты = Стационар.ПолучитьПалатыКлиентаПоМедкарте(МедицинскаяКарта, Истина);
	ОбластьШапка.Параметры.Диагноз = ПолучитьДиагнозПоМедицинскойКарта(МедицинскаяКарта);
	
	ТабДок.Вывести(ОбластьШапка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыЛечения.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Медикаменты) КАК ДляТаблицыОтметок,
		|	ПланыЛечения.Номенклатура КАК Назначение,
		|	ВЫБОР
		|		КОГДА ПланыЛечения.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПланыЛечения.ДокументРегистратор.Дата
		|		ИНАЧЕ ПланыЛечения.Дата
		|	КОНЕЦ КАК ДатаНазначения,
		|	ВЫБОР
		|		КОГДА ПланыЛечения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				И ПланыЛечения.Дата <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПланыЛечения.Дата
		|		ИНАЧЕ ПланыЛечения.ДатаОкончания
		|	КОНЕЦ КАК ДатаОтмены
		|ПОМЕСТИТЬ ЭлементыПланаЛечения
		|ИЗ
		|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Прием КАК ПервичныеПриемы
		|		ПО (ПервичныеПриемы.Ссылка = ПланыЛечения.ПервичныйПрием)
		|			И (ПервичныеПриемы.МедицинскаяКарта = &МедицинскаяКарта)
		|			И (ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Медикаменты)
		|				ИЛИ ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Обследование)
		|				ИЛИ ПланыЛечения.ВидЭлемента = ЗНАЧЕНИЕ(Перечисление.ВидыНазначений.Процедура))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИзменениеРежимаДействияСтационара.ИдентификаторДействия,
		|	ИСТИНА,
		|	ИзменениеРежимаДействияСтационара.ДействиеСтационара,
		|	ИзменениеРежимаДействияСтационара.ДатаНачала,
		|	ИзменениеРежимаДействияСтационара.ДатаОкончания
		|ИЗ
		|	Документ.ИзменениеРежима.ДействияСтационара КАК ИзменениеРежимаДействияСтационара
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ИзменениеРежима КАК ИзменениеРежима
		|		ПО (ИзменениеРежима.Ссылка = ИзменениеРежимаДействияСтационара.Ссылка)
		|			И (ИзменениеРежима.МедицинскаяКарта = &МедицинскаяКарта)
		|ГДЕ
		|	НЕ ИзменениеРежимаДействияСтационара.ДействиеСтационара В (&ДействияТемпературногоЛиста)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЭлементыПланаЛечения.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	ЭлементыПланаЛечения.Назначение КАК Назначение,
		|	ЭлементыПланаЛечения.ДатаНазначения КАК ДатаНазначения,
		|	ЭлементыПланаЛечения.ДатаОтмены КАК ДатаОтмены,
		|	НАЧАЛОПЕРИОДА(ВыполнениеДействийСтационара.ДатаВремяВыполнения, ДЕНЬ) КАК ДатаВыполнения,
		|	ВыполнениеДействийСтационара.ДатаВремяВыполнения КАК ДатаВремяВыполнения
		|ИЗ
		|	ЭлементыПланаЛечения КАК ЭлементыПланаЛечения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыполнениеДействийСтационара КАК ВыполнениеДействийСтационара
		|		ПО (ВыполнениеДействийСтационара.ИдентификаторЭлемента = ЭлементыПланаЛечения.ИдентификаторЭлемента)
		|			И (ВыполнениеДействийСтационара.ДействиеСтационара = ЭлементыПланаЛечения.Назначение)
		|ГДЕ
		|	ЭлементыПланаЛечения.ДляТаблицыОтметок
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЭлементыПланаЛечения.ИдентификаторЭлемента,
		|	ЭлементыПланаЛечения.Назначение,
		|	ЭлементыПланаЛечения.ДатаНазначения,
		|	NULL,
		|	НАЧАЛОПЕРИОДА(ВыполнениеПланаЛечения.Период, ДЕНЬ),
		|	ВыполнениеПланаЛечения.Период
		|ИЗ
		|	ЭлементыПланаЛечения КАК ЭлементыПланаЛечения
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыполнениеПланаЛечения КАК ВыполнениеПланаЛечения
		|		ПО (ВыполнениеПланаЛечения.ИдентификаторЭлемента = ЭлементыПланаЛечения.ИдентификаторЭлемента)
		|ГДЕ
		|	НЕ ЭлементыПланаЛечения.ДляТаблицыОтметок
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНазначения,
		|	ИдентификаторЭлемента,
		|	ДатаВремяВыполнения";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	Запрос.УстановитьПараметр("ДействияТемпературногоЛиста", Справочники.ДействияМедсестрыСтационара.ПоказателиЗдоровья003уССопутствующими());
	
	КоличествоКолонокДат = КоличествоКолонокДат();
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ВыполненияДляТаблицыОтметок = РезультатыЗапроса[1].Выгрузить();
	//ВыполненияДляТаблицыВмешательств = РезультатыЗапроса[2].Выгрузить();
	
	ВыполненияДляТаблицыОтметок.Колонки.Добавить("ИндексКолонки");
	ВыполненияДляТаблицыОтметок.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ВыполненияДляТаблицыОтметок.ЗаполнитьЗначения(1, "Количество");
	
	// Пустой бланк
	Если ВыполненияДляТаблицыОтметок.Количество() = 0 Тогда
		ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТаблицыОтметок"));
		Для Итератор = 1 По 10 Цикл
			ТабДок.Вывести(Макет.ПолучитьОбласть("СтрокаТаблицыОтметок"));
		КонецЦикла;
		ТабДок.Вывести(Макет.ПолучитьОбласть("ПодвалТаблицыОтметок"));
	КонецЕсли;
	
	мДанныеТаблицОтметок = Новый Массив;
	
	Пока ВыполненияДляТаблицыОтметок.Количество() > 0 Цикл
		ДатыВыполнения = ВыполненияДляТаблицыОтметок.Скопировать();
		ДатыВыполнения.Свернуть("ИдентификаторЭлемента, ДатаВыполнения", "Количество");
		ДатыВыполнения.Сортировать("ДатаВыполнения");
		
		РазличныеДаты = ДатыВыполнения.Скопировать();
		РазличныеДаты.Свернуть("ДатаВыполнения");
		
		ДатыТекущейТаблицы = Новый Массив;
		КоличествоДатВТекущейТаблице = Новый Соответствие;
		
		Для Каждого СтрокаДаты Из РазличныеДаты Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДаты.ДатаВыполнения) Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоКолонокТекущейДаты = 1;
			КоличествоКолонокТекущейДатыВТекущейТаблице = 0;
			
			СтрокиДаты = ДатыВыполнения.НайтиСтроки(Новый Структура("ДатаВыполнения", СтрокаДаты.ДатаВыполнения));
			Для Каждого СтрокаДаты Из СтрокиДаты Цикл
				КоличествоКолонокТекущейДаты = Макс(КоличествоКолонокТекущейДаты, СтрокаДаты.Количество);
			КонецЦикла;
			
			Для Итератор = 1 По КоличествоКолонокТекущейДаты Цикл
				ДатыТекущейТаблицы.Добавить(СтрокаДаты.ДатаВыполнения);
				КоличествоКолонокТекущейДатыВТекущейТаблице = КоличествоКолонокТекущейДатыВТекущейТаблице + 1;
				Если ДатыТекущейТаблицы.Количество() = КоличествоКолонокДат Тогда
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			КоличествоДатВТекущейТаблице.Вставить(СтрокаДаты.ДатаВыполнения, КоличествоКолонокТекущейДатыВТекущейТаблице);
			
			Если ДатыТекущейТаблицы.Количество() = КоличествоКолонокДат Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		мСтрокиТекущейТаблицы = Новый Массив;
		ЭлементыПланаЛеченияТекущейТаблицы = ВыполненияДляТаблицыОтметок.СкопироватьКолонки();
		
		Для Каждого КлючЗначение Из КоличествоДатВТекущейТаблице Цикл
			ТекущаяДатаВыполнения = КлючЗначение.Ключ;
			МаксимальноеКоличествоПоНазначению = КлючЗначение.Значение;
			
			КоличествоСтрокПоЭлементам = Новый Соответствие;
			СтрокиПоТекущейДатеВыполнения = ВыполненияДляТаблицыОтметок.НайтиСтроки(Новый Структура("ДатаВыполнения", ТекущаяДатаВыполнения));
			ОбщегоНазначенияБИТКлиентСервер.ВосстановитьПорядокНайденныхСтрок(СтрокиПоТекущейДатеВыполнения, ВыполненияДляТаблицыОтметок);
			
			Для Каждого СтрокаПоДате Из СтрокиПоТекущейДатеВыполнения Цикл
				
				КоличествоСтрокПоИдентификатору = КоличествоСтрокПоЭлементам.Получить(СтрокаПоДате.ИдентификаторЭлемента);
				Если КоличествоСтрокПоИдентификатору = Неопределено Тогда
					КоличествоСтрокПоИдентификатору = 0;
				ИначеЕсли КоличествоСтрокПоИдентификатору = МаксимальноеКоличествоПоНазначению Тогда
					Продолжить;
				КонецЕсли;
				
				мСтрокиТекущейТаблицы.Добавить(СтрокаПоДате);
				ЗаполнитьЗначенияСвойств(ЭлементыПланаЛеченияТекущейТаблицы.Добавить(), СтрокаПоДате);
				
				КоличествоСтрокПоЭлементам.Вставить(СтрокаПоДате.ИдентификаторЭлемента, КоличествоСтрокПоИдентификатору + 1);
			КонецЦикла;
		КонецЦикла;
		
		Для Каждого СтрокаБезВыполнений Из ВыполненияДляТаблицыОтметок.НайтиСтроки(Новый Структура("ДатаВыполнения", Null)) Цикл
			
			Если ДатыТекущейТаблицы.Количество() = 0
				Или СтрокаБезВыполнений.ДатаНазначения <= ДатыТекущейТаблицы[ДатыТекущейТаблицы.ВГраница()]
				Или СтрокаБезВыполнений.ДатаОтмены >= ДатыТекущейТаблицы[0]
			Тогда
				мСтрокиТекущейТаблицы.Добавить(СтрокаБезВыполнений);
				ЗаполнитьЗначенияСвойств(ЭлементыПланаЛеченияТекущейТаблицы.Добавить(), СтрокаБезВыполнений);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого СтрокаТекТаблицы Из мСтрокиТекущейТаблицы Цикл
			ВыполненияДляТаблицыОтметок.Удалить(СтрокаТекТаблицы);
		КонецЦикла;
		
		ЭлементыПланаЛеченияТекущейТаблицы.Сортировать("ДатаНазначения, ИдентификаторЭлемента, ДатаВремяВыполнения");
		
		мДанныеТаблицОтметок.Добавить(Новый Структура("Даты, Элементы", ДатыТекущейТаблицы, ЭлементыПланаЛеченияТекущейТаблицы));
	КонецЦикла;
	
	Для Каждого ДанныеТаблицыОтметок Из мДанныеТаблицОтметок Цикл
		
		ОбластьШапкиТаблицыОтметок = Макет.ПолучитьОбласть("ШапкаТаблицыОтметок");
		ИндексДаты = 0;
		Для Каждого ДатаТаблицы Из ДанныеТаблицыОтметок.Даты Цикл
			ОбластьШапкиТаблицыОтметок.Параметры[СтрШаблон("Дата%1", ИндексДаты)] = Формат(ДатаТаблицы, "ДФ=dd.MM.yyyy");
			ИндексДаты = ИндексДаты + 1;
		КонецЦикла;
		ТабДок.Вывести(ОбластьШапкиТаблицыОтметок);
		
		ИдентификаторыЭлементов = ДанныеТаблицыОтметок.Элементы.Скопировать();
		ИдентификаторыЭлементов.Свернуть("ИдентификаторЭлемента, Назначение, ДатаНазначения, ДатаОтмены");
		
		Для Каждого СтрокаНазначения Из ИдентификаторыЭлементов Цикл
			
			ОбластьСтрокиТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицыОтметок");
			ОбластьСтрокиТаблицы.Параметры.ПрепаратРежим	= СтрокаНазначения.Назначение;
			ОбластьСтрокиТаблицы.Параметры.ДатаНазначения	= Формат(СтрокаНазначения.ДатаНазначения, "ДФ=dd.MM.yyyy");
			ОбластьСтрокиТаблицы.Параметры.ДатаОтмены		= Формат(СтрокаНазначения.ДатаОтмены, "ДФ=dd.MM.yyyy");
			
			СтрокиВремениВыполненияНазначений = ДанныеТаблицыОтметок.Элементы.НайтиСтроки(Новый Структура("ИдентификаторЭлемента", СтрокаНазначения.ИдентификаторЭлемента));
			ОбщегоНазначенияБИТКлиентСервер.ВосстановитьПорядокНайденныхСтрок(СтрокиВремениВыполненияНазначений, ДанныеТаблицыОтметок.Элементы);
			
			ИндексДаты = 0;
			Для Каждого Дата Из ДанныеТаблицыОтметок.Даты Цикл
				Для Каждого СтрокаВремениВыполнения Из СтрокиВремениВыполненияНазначений Цикл
					
					Если СтрокаВремениВыполнения.ИндексКолонки = Неопределено
						И СтрокаВремениВыполнения.ДатаВыполнения = Дата
					Тогда
						СтрокаВремениВыполнения.ИндексКолонки = ИндексДаты;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				ИндексДаты = ИндексДаты + 1;
			КонецЦикла;
			
			Для Каждого СтрокаВремениВыполнения Из СтрокиВремениВыполненияНазначений Цикл
				Если СтрокаВремениВыполнения.ИндексКолонки <> Неопределено Тогда
					ОбластьСтрокиТаблицы.Параметры[СтрШаблон("Время%1", СтрокаВремениВыполнения.ИндексКолонки)] = Формат(СтрокаВремениВыполнения.ДатаВремяВыполнения, "ДФ=ЧЧ:мм");
				КонецЕсли;
			КонецЦикла;
			
			ТабДок.Вывести(ОбластьСтрокиТаблицы);
		КонецЦикла;
		
		ТабДок.Вывести(Макет.ПолучитьОбласть("ПодвалТаблицыОтметок"));
	КонецЦикла;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	//ОбластьШапкиТаблицыВмешательств = Макет.ПолучитьОбласть("ШапкаТаблицыВмешательств");
	//ТабДок.Вывести(ОбластьШапкиТаблицыВмешательств);
	
	// Пустой бланк
	//Если ВыполненияДляТаблицыВмешательств.Количество() = 0 Тогда
	//	Для Итератор = 1 По 10 Цикл
	//		ТабДок.Вывести(Макет.ПолучитьОбласть("СтрокаТаблицыВмешательств"));
	//	КонецЦикла;
	//КонецЕсли;
	
	//Для Каждого СтрокаПроцедур Из ВыполненияДляТаблицыВмешательств Цикл
	//	ОбластьСтрокиТаблицыВмешательств = Макет.ПолучитьОбласть("СтрокаТаблицыВмешательств");
	//	ОбластьСтрокиТаблицыВмешательств.Параметры.МедицинскоеВмешательство = СтрокаПроцедур.Назначение;
	//	ОбластьСтрокиТаблицыВмешательств.Параметры.ДатаНазначения = Формат(СтрокаПроцедур.ДатаНазначения, "ДФ=dd.MM.yyyy");
	//	ОбластьСтрокиТаблицыВмешательств.Параметры.ДатаИсполнения = Формат(СтрокаПроцедур.ДатаВремяВыполнения, "ДФ='dd.MM.yyyy ЧЧ:мм'");
	//	ТабДок.Вывести(ОбластьСтрокиТаблицыВмешательств);
	//КонецЦикла;
	
	Возврат ТабДок;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеНазначений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыЛечения.ИдентификаторЭлемента КАК ИдентификаторЭлемента,
		|	ПланыЛечения.ВидЭлемента КАК ВидЭлемента,
		|	ПланыЛечения.Номенклатура КАК Назначение,
		|	ПланыЛечения.ДокументРегистратор КАК ДокументРегистратор,
		|	ВЫБОР
		|		КОГДА ПланыЛечения.Дата = ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПланыЛечения.ДокументРегистратор.Дата
		|		ИНАЧЕ ПланыЛечения.Дата
		|	КОНЕЦ КАК ДатаНазначения,
		|	ВЫБОР
		|		КОГДА ПланыЛечения.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
		|				И ПланыЛечения.Дата <> ДАТАВРЕМЯ(1, 1, 1)
		|			ТОГДА ПланыЛечения.Дата
		|		ИНАЧЕ ПланыЛечения.ДатаОкончания
		|	КОНЕЦ КАК ДатаОтмены,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ПланыЛечения.ПриемовВДень, 0) = 0
		|			ТОГДА 1
		|		ИНАЧЕ ПланыЛечения.ПриемовВДень
		|	КОНЕЦ КАК РазВДень
		|ИЗ
		|	РегистрСведений.ПланыЛечения КАК ПланыЛечения
		|ГДЕ
		|	ПланыЛечения.ПервичныйПрием.МедицинскаяКарта = &МедицинскаяКарта
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаНазначения,
		|	ВидЭлемента,
		|	ПланыЛечения.Номенклатура
		|ИТОГИ ПО
		|	ВидЭлемента";
	
	Запрос.УстановитьПараметр("МедицинскаяКарта", МедицинскаяКарта);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

Функция КоличествоКолонокДат()
	
	Возврат 16;
	
КонецФункции

Функция ПолучитьДиагнозПоМедицинскойКарта(МедицинскаяКарта)
	
	ВручнуюЗаполненныйДиагнозКлинический = Неопределено;
	ДиагнозКлиническийПолныйТекст = Неопределено;
	
	СтрокиВручнуюЗаполненногоДиагнозаКлинического = МедицинскаяКарта.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", "ДиагнозКлиническийПолныйТекст"));
	Если СтрокиВручнуюЗаполненногоДиагнозаКлинического.Количество() > 0 Тогда
		Возврат СтрокиВручнуюЗаполненногоДиагнозаКлинического[0].Значение;
	КонецЕсли;
	
	ДатаИДокументКлиническогоДиагноза = Стационар.ДанныеДокументаКлиническогоДиагнозаМедкарты(МедицинскаяКарта);
	Если ЗначениеЗаполнено(ДатаИДокументКлиническогоДиагноза.Документ) Тогда
		СтандатноеОписаниеДиагнозов = Стационар.СтандатноеОписаниеДиагнозовМД_003(ДатаИДокументКлиническогоДиагноза.Документ);
		Если ЗначениеЗаполнено(СтандатноеОписаниеДиагнозов.ОписаниеДиагнозов) Тогда
			Возврат СтандатноеОписаниеДиагнозов.ОписаниеДиагнозов;
		КонецЕсли;
	КонецЕсли;
	
	ВручнуюЗаполненныйДиагнозПриПоступлении = Неопределено;
	ДиагнозПриПоступленииПолныйТекст = Неопределено;
	
	СтрокиВручнуюЗаполненногоДиагнозаПриПоступлении = МедицинскаяКарта.ЗаполняемыеПараметры.НайтиСтроки(Новый Структура("ИмяВручнуюЗаполненногоПараметра", "ДиагнозПриПоступленииПолныйТекст"));
	Если СтрокиВручнуюЗаполненногоДиагнозаПриПоступлении.Количество() > 0 Тогда
		Возврат СтрокиВручнуюЗаполненногоДиагнозаПриПоступлении[0].Значение;
	КонецЕсли;
	
	ВидМД = ИнтеграцияЕГИСЗСервер.ЭлементКлассификатораПоID(381, "ВидыМедицинскихДокументов"); // Первичный осмотр приемного отделения.
	ДокументыКарты = МедицинскаяДеятельность.ДокументыПоВидуДокументации(МедицинскаяКарта, ВидМД);
	Если ДокументыКарты.Количество() <> 0 Тогда
		СтандатноеОписаниеДиагнозов = Стационар.СтандатноеОписаниеДиагнозовМД_003(ДокументыКарты[ДокументыКарты.Количество() - 1].Документ);
		Возврат СтандатноеОписаниеДиагнозов.ОписаниеДиагнозов;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти
